#Подключение файлов игры
import gameData
import characters as ch

#Главный код игры
######################################################
#               -- Н А Ч А Л О --                    #
######################################################
print("=====================================")
print("Game started")
print(f"version: {gameData.VERSION}")
print("=====================================")
############################################################

print("Введите ваше имя")
ch.Player.name = name = input("] ")
print("=====================================")
############################################################

print("------------------------------------")
print('''Вы перед сараем, он закрыт, за вами слышны рыки зверёв, на полу лежит ключ.''')
print("подобрать ключь?")
print("------------------------------------")
print("1. Да")
print("2. Нет")

############################################################
choose = int(input("] "))
if choose == 1:
    print("вы подобрали ключь")
    gameData.isKeyPlayer = True

elif choose == 2:
    print("вы не подобрали ключь")
    gameData.isKeyPlayer = False

else:
    print("неверный ввод")
############################################################

print("=====================================")
print("------------------------------------")
print("Перед вами дверь сарая.")
print("Открыть?")
print("------------------------------------")
print("1. Да")
print("2. Нет")

############################################################
choose = int(input("] "))
if choose == 1 and gameData.isKeyPlayer == True:
    print("вы открыли дверь и попали сарай.")
    gameData.isKeyPlayer = True
    ch.Wolf.dialog("Гав-гав!")

elif choose == 1 and gameData.isKeyPlayer == False:

    print(f"вы не можете открыть дверь без ключа! {ch.Player.name} был съеден волками.")
    gameData.isKeyPlayer = False

elif choose == 2:
    print("Вы решили не открывать дверь. Вас сгрызли медведи.")
    gameData.isKeyPlayer = False

else:
    print("неверный ввод")
############################################################

print("=====================================")


